Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/drv/i2c/rtl8735b_i2c_simple.c
/**************************************************************************//**
 * @file     rom_i2c.c
 * @brief    This file implements the I2C HAL functions.
 *
 * @version  V1.00
 * @date     2017-03-07
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/


#if !defined (CONFIG_VOE_PLATFORM) || !CONFIG_VOE_PLATFORM // Run on TM9
#include "cmsis.h"
#else
#include "cmsis_voe.h"
#include "voe.h"
#endif
#include "rtl8735b_i2c_simple.h"
#include "isp_log.h"
#include "hal_timer.h"
#include "platform_conf.h"

#if 1

/**
 * @addtogroup hs_hal_i2c I2C
 * @{
 */

/** \brief Description of hal_rtl_i2c_set_clk_simple
 *
 *    hal_rtl_i2c_set_clk_simple is used to set I2C clock.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:     Pointer to I2C control adapter.
 *   \return hal_status_t:      HAL status.
 */
hal_status_t hal_rtl_i2c_set_clk_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    I2C_TypeDef *pi2c_reg = (I2C_TypeDef *)phal_i2c_adapter->init_dat.reg_base;
    uint32_t clock   = phal_i2c_adapter->init_dat.clock;
    uint32_t ic_hl_cnt;
    uint32_t ic_h_time;
    uint32_t ic_l_time;

    /* Get the IC-Clk setting first for the following process*/
#if CONFIG_FPGA // FPGA
    uint32_t sys_clk  = (400000000/4)/1000000;
#else
    uint32_t sys_clk  = (400000000/4)/1000000;
#endif

    isp_info("hal_rtl_i2c_set_clk_simple, spd mod: %x\n\r", phal_i2c_adapter->init_dat.spd_mod);

    switch (phal_i2c_adapter->init_dat.spd_mod) {
        case I2CStandardSpeed:
            ic_h_time = ((1000000/clock)*I2C_SS_MIN_SCL_HTIME)/(I2C_SS_MIN_SCL_HTIME+I2C_SS_MIN_SCL_LTIME);
            ic_l_time = ((1000000/clock)*I2C_SS_MIN_SCL_LTIME)/(I2C_SS_MIN_SCL_HTIME+I2C_SS_MIN_SCL_LTIME);

            ic_hl_cnt = (ic_h_time * sys_clk)/1000;
            if (ic_hl_cnt < I2C_SS_HTIME_MIN) {
                isp_error("*** I2C clock is not available.\n\r");
                return HAL_ERR_PARA;
            }
            //if (ic_hl_cnt>4) {/*this part is according to the fine-tune result*/
            //    ic_hl_cnt -= 4;
            //}

            pi2c_reg->I2C_SS_SCL_HCNT = ic_hl_cnt;
            isp_info("ICHtime:%x\n\r", pi2c_reg->I2C_SS_SCL_HCNT);
            ic_hl_cnt = (ic_l_time * sys_clk)/1000;
            if (ic_hl_cnt < I2C_SS_LTIME_MIN) {
                isp_error("*** I2C clock is not available.\n\r");
                return HAL_ERR_PARA;
            }
            //if (ic_hl_cnt>3) {/*this part is according to the fine-tune result*/
            //    ic_hl_cnt -= 3;
            //}
            pi2c_reg->I2C_SS_SCL_LCNT = ic_hl_cnt;
            isp_info("ICLtime:%x\n\r", pi2c_reg->I2C_SS_SCL_LCNT);
            break;

        case I2CFastSpeed:
            ic_h_time = ((1000000/clock)*I2C_FS_MIN_SCL_HTIME)/(I2C_FS_MIN_SCL_HTIME+I2C_FS_MIN_SCL_LTIME);
            ic_l_time = ((1000000/clock)*I2C_FS_MIN_SCL_LTIME)/(I2C_FS_MIN_SCL_HTIME+I2C_FS_MIN_SCL_LTIME);

            ic_hl_cnt = (ic_h_time * sys_clk)/1000;
            if (ic_hl_cnt < I2C_FS_HTIME_MIN) {
                isp_error("*** I2C clock is not available.\n\r");
                isp_error("h_cnt: %x\n\r", ic_hl_cnt);
                return HAL_ERR_PARA;
            }
            //if (ic_hl_cnt>4) {/*this part is according to the fine-tune result*/
            //    ic_hl_cnt -= 4;
            //}

            pi2c_reg->I2C_FS_SCL_HCNT = ic_hl_cnt;
            isp_info("fs_scl_hcnt%d: %x\n\r", phal_i2c_adapter->init_dat.index, pi2c_reg->I2C_FS_SCL_HCNT);
            ic_hl_cnt = (ic_l_time * sys_clk)/1000;
            if (ic_hl_cnt < I2C_FS_LTIME_MIN) {
                isp_error("*** I2C clock is not available.\n\r");
                isp_error("h_cnt: %x\n\r", ic_hl_cnt);
                return HAL_ERR_PARA;
            }
            //if (ic_hl_cnt>3) {/*this part is according to the fine-tune result*/
            //    ic_hl_cnt -= 3;
            //}

            pi2c_reg->I2C_FS_SCL_LCNT = ic_hl_cnt;
            isp_info("fs_scl_lcnt%d: %x\n\r", phal_i2c_adapter->init_dat.index, pi2c_reg->I2C_FS_SCL_LCNT);
            break;

        case I2CHighSpeed:
            ic_hl_cnt = 400;
            pi2c_reg->I2C_SS_SCL_HCNT = ic_hl_cnt;

            ic_hl_cnt = 470;
            pi2c_reg->I2C_SS_SCL_LCNT = ic_hl_cnt;

            ic_hl_cnt = 60;
            pi2c_reg->I2C_FS_SCL_HCNT = ic_hl_cnt;

            ic_hl_cnt = 130;
            pi2c_reg->I2C_FS_SCL_LCNT = ic_hl_cnt;

            ic_h_time = ((1000000/clock)*I2C_HS_MIN_SCL_HTIME_100)/(I2C_HS_MIN_SCL_HTIME_100+I2C_HS_MIN_SCL_LTIME_100);
            ic_l_time = ((1000000/clock)*I2C_HS_MIN_SCL_LTIME_100)/(I2C_HS_MIN_SCL_HTIME_100+I2C_HS_MIN_SCL_LTIME_100);
            isp_info("ICHtime:%x\n\r", ic_h_time);
            isp_info("ICLtime:%x\n\r", ic_l_time);

            ic_hl_cnt = (ic_h_time * sys_clk)/1000;
            if (ic_hl_cnt < I2C_HS_HTIME_MIN) {
                isp_error("*** I2C clock is not available.\n\r");
                return HAL_ERR_PARA;
            }
            //if (ic_hl_cnt>8) {/*this part is according to the fine-tune result*/
            //    ic_hl_cnt -= 3;
            //}

            pi2c_reg->I2C_HS_SCL_HCNT = ic_hl_cnt;
            isp_info("hs_scl_hcnt%d: %x\n\r", phal_i2c_adapter->init_dat.index, pi2c_reg->I2C_HS_SCL_HCNT);

            ic_hl_cnt = (ic_l_time * sys_clk)/1000;
            if (ic_hl_cnt < I2C_HS_LTIME_MIN) {
                isp_error("*** I2C clock is not available.\n\r");
                return HAL_ERR_PARA;
            }
            //if (ic_hl_cnt>6) {/*this part is according to the fine-tune result*/
            //    ic_hl_cnt -= 6;
            //}

            pi2c_reg->I2C_HS_SCL_LCNT = ic_hl_cnt;
            isp_info("hs_scl_lcnt%d: %x\n\r", phal_i2c_adapter->init_dat.index, pi2c_reg->I2C_HS_SCL_LCNT);
            break;

        default:
            break;
    }

    return HAL_OK;
}

/** \brief Description of hal_rtl_i2c_en_ctrl_simple
 *
 *    hal_rtl_i2c_en_ctrl_simple is used to enable/disable I2C module.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:     Pointer to I2C control adapter.
 *   \param[in] uint8_t enable: To enable/disable I2C.\n\r
 *                                  0: Disable.\n\r
 *                                  1: Enable\n\r
 *                                  2: Force Disable
 *   \retrun uint8_t:               I2C enable status.
 */
uint8_t hal_rtl_i2c_en_ctrl_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter, uint8_t enable)
{
    I2C_TypeDef *pi2c_reg = phal_i2c_adapter->init_dat.reg_base;
    uint32_t ic_en_tmp;

    ic_en_tmp = pi2c_reg->I2C_ENABLE;
    if (enable == 2) {
        HAL_SET_BIT(ic_en_tmp, I2C_BIT_ABRT);
        HAL_CLEAR_BIT(ic_en_tmp, I2C_BIT_EN);
    } else if (enable == 0) {
        HAL_CLEAR_BIT(ic_en_tmp, I2C_BIT_ABRT);
        HAL_CLEAR_BIT(ic_en_tmp, I2C_BIT_EN);
    } else {
        HAL_CLEAR_BIT(ic_en_tmp, I2C_BIT_ABRT);
        HAL_SET_BIT(ic_en_tmp, I2C_BIT_EN);
    }

    /* Enable/Disable I2C module */
    pi2c_reg->I2C_ENABLE = ic_en_tmp;
    isp_info("ic_enable(%x): %x, %x\n\r", &(pi2c_reg->I2C_ENABLE), pi2c_reg->I2C_ENABLE, ic_en_tmp);
    //DBG_8195BL("ic_enable(%x): %x\n\r", &(pi2c_reg->enable), pi2c_reg->enable);

    if (enable != 1) {
        while (pi2c_reg->I2C_EN_STS & I2C_BIT_EN_STS) {
        }
    } else {
        while (!(pi2c_reg->I2C_EN_STS & I2C_BIT_EN_STS)) {
        }
    }

    return (uint8_t)(pi2c_reg->I2C_EN_STS & I2C_BIT_EN_STS);
}


/// @cond DOXYGEN_ROM_HAL_API

