Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/drv/i2c/rtl8735b_i2c_simple.c
/** \brief Description of hal_rtl_i2c_timeout_chk_simple
 *
 *    hal_rtl_i2c_timeout_chk_simple is used to check if I2C operation is time-out.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter: Pointer to I2C control adapter.
 *   \param[in] uint32_t start_cnt: Start system time count.
 *
 *   \return uint8_t:       Time out result \n\r\t
 *                          0: NOT time-out, 1: Time-out.
 */
uint8_t hal_rtl_i2c_timeout_chk_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter, uint32_t start_cnt)
{
    uint32_t time_out_cnt = 0;
    uint32_t curr_cnt = 0;
    uint32_t expire_cnt = 0;
	static uint32_t i2c_log_cnt = 0;

    if ((phal_i2c_adapter->pltf_dat.tr_time_out != HP_I2C_TIMEOUT_DISABLE) &&
                (phal_i2c_adapter->pltf_dat.tr_time_out != HP_I2C_TIMEOUT_ENDLESS)) {
        time_out_cnt = phal_i2c_adapter->pltf_dat.tr_time_out;
        curr_cnt = hal_read_curtime_us();

        if (start_cnt <= curr_cnt) {
            expire_cnt =  curr_cnt - start_cnt;//(0xFFFFFFFF - curr_cnt) + start_cnt;
        } else {
            expire_cnt = (0xFFFFFFFF - start_cnt) + curr_cnt;//start_cnt - curr_cnt;
        }

        if (time_out_cnt < expire_cnt){
            return 1;//time-out
        } else {
        	if (time_out_cnt > 30000 && i2c_log_cnt == 0) {
        		printf("i2c time_out_cnt: %x, curr_cnt: %x, start_cnt: %x, expire_cnt: %x\n\r",
					time_out_cnt, curr_cnt, start_cnt, expire_cnt);
				i2c_log_cnt = 1;
        	} else if (time_out_cnt < 30000) {
				i2c_log_cnt = 0;
        	}
            return 0;
        }
    } else if (phal_i2c_adapter->pltf_dat.tr_time_out == HP_I2C_TIMEOUT_DISABLE) {
        return 1;   //time-out
    }

    return 0;
}

/** \brief Description of hal_rtl_i2c_chk_mod_simple
 *
 *    hal_rtl_i2c_chk_mod_simple is used to check I2C operation mode.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:     Pointer to I2C control adapter.
 *   \return uint8_t:           Check mode status. \n\r
 *                              0: Slave mode\n\r
 *                              1: Master mode\n\r
 *                              2: Configuration error.\n\r
 */
uint8_t hal_rtl_i2c_chk_mod_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    uint32_t ic_con_tmp;

    ic_con_tmp = phal_i2c_adapter->init_dat.reg_base->I2C_CON;

    if (((ic_con_tmp & I2C_BIT_MST_MOD) == 0) &&
        ((ic_con_tmp & (I2C_BIT_SLV_DIS | I2C_BIT_SLV_DIS_1)) != (I2C_BIT_SLV_DIS | I2C_BIT_SLV_DIS_1))) {
        /* 0 for slave mode */
        return 0;
    } else if (((ic_con_tmp & I2C_BIT_MST_MOD) == 1) &&
               ((ic_con_tmp & (I2C_BIT_SLV_DIS | I2C_BIT_SLV_DIS_1)) == (I2C_BIT_SLV_DIS | I2C_BIT_SLV_DIS_1))) {
        /* 1 for master mode */
        return 1;
    } else {
        /* 2 for error config */
        return 2;
    }
}

/** \brief Description of hal_rtl_i2c_pure_init_simple
 *
 *    hal_rtl_i2c_pure_init_simple is used to initialize I2C module.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:     Pointer to I2C control adapter.
 *   \return uint8_t :      i2c enable status
 */
uint8_t hal_rtl_i2c_pure_init_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    uint8_t  restart;
    uint32_t ic_value_tmp;
    i2c_init_dat_t *pi2c_init_data = (i2c_init_dat_t *)&(phal_i2c_adapter->init_dat);
    I2C_TypeDef *pi2c_reg = (I2C_TypeDef *)phal_i2c_adapter->init_dat.reg_base;
    uint32_t ic_con_tmp;
    uint32_t ic_tar_tmp;
    uint32_t ic_filter_tmp;

    isp_info("hal_rtl_i2c_pure_init_simple\n\r");

    restart = 0;

    /* Disable the IC first */
    hal_rtl_i2c_en_ctrl_simple(phal_i2c_adapter, I2CDisable);

    /* Master case*/
    if (pi2c_init_data->master) {
        /*RESTART MUST be set in these condition in Master mode.
               But it might be NOT compatible in old slaves.*/
        if ((pi2c_init_data->addr_mod == I2CAddress10bit) || (pi2c_init_data->spd_mod == I2CHighSpeed)) {
            restart = 1;
        }

        ic_con_tmp = 0;
        HAL_SET_BIT(ic_con_tmp, I2C_BIT_SLV_DIS|I2C_BIT_SLV_DIS_1
                                            |(restart<<I2C_SHIFT_RSTRT_EN)
                                            |(pi2c_init_data->addr_mod<<I2C_SHIFT_MST_10BIT_ADDR)
                                            |(pi2c_init_data->spd_mod<<I2C_SHIFT_SPD)
                                            |(pi2c_init_data->master<<I2C_SHIFT_MST_MOD));
        pi2c_reg->I2C_CON = ic_con_tmp;
        isp_info("Init master, con[%2x]: %x, %x\n\r", &(pi2c_reg->I2C_CON), pi2c_reg->I2C_CON, ic_con_tmp);
        /* To set target addr.*/
        ic_tar_tmp = 0;
        HAL_SET_BIT(ic_tar_tmp, (pi2c_init_data->addr_mod<<I2C_SHIFT_TAR_10BIT_ADDR)
                                            |(pi2c_init_data->ack_addr0<<I2C_SHIFT_TAR));
        pi2c_reg->I2C_TAR = ic_tar_tmp;
        isp_info("Init master, tar[%2x]: %x, %x\n\r", &(pi2c_reg->I2C_TAR), pi2c_reg->I2C_TAR, ic_tar_tmp);

        /* To Set I2C clock*/
        hal_rtl_i2c_set_clk_simple(phal_i2c_adapter);

        /* Set master code */
        pi2c_reg->I2C_HS_MADDR = pi2c_init_data->hs_maddr;
        isp_info("Init master, hs_maddr[%2x]: %x, %x\n\r", &(pi2c_reg->I2C_HS_MADDR), pi2c_reg->I2C_HS_MADDR, pi2c_init_data->hs_maddr);
    }else {
        ic_con_tmp = 0;
        HAL_SET_BIT(ic_con_tmp, (pi2c_init_data->master<<I2C_SHIFT_SLV_DIS)
                                            |(pi2c_init_data->master<<I2C_SHIFT_SLV_DIS_1)
                                            |(pi2c_init_data->addr_mod<<I2C_SHIFT_SLV_10BIT_ADDR)
                                            |(pi2c_init_data->spd_mod<<I2C_SHIFT_SPD)
                                            |(pi2c_init_data->master<<I2C_SHIFT_MST_MOD));
        pi2c_reg->I2C_CON = ic_con_tmp;
        isp_info("Init slave, con%d[%2x]: %x\n\r", pi2c_init_data->index, &pi2c_reg->I2C_CON, pi2c_reg->I2C_CON);

        /* To set slave addr. 0 */
        pi2c_reg->I2C_SAR = pi2c_init_data->ack_addr0;
        isp_info("Init slave, sar%d[%2x]: %x\n\r", pi2c_init_data->index, &pi2c_reg->I2C_SAR, pi2c_reg->I2C_SAR);

        /* To set slave addr. 1 */
        pi2c_reg->I2C_SAR1 = pi2c_init_data->ack_addr1;
        isp_info("Init slave, sar1%d[%2x]: %x\n\r", pi2c_init_data->index, &pi2c_reg->I2C_SAR1, pi2c_reg->I2C_SAR1);

        /* To Set I2C clock*/
        hal_rtl_i2c_set_clk_simple(phal_i2c_adapter);


