Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/drv/i2c/rtl8735b_i2c_simple.c
    }

    /* to set SDA hold time */
    ic_con_tmp = pi2c_reg->I2C_CON;
    if (((ic_con_tmp & I2C_MASK_SPD)>>I2C_SHIFT_SPD) == I2CStandardSpeed) {
        ic_value_tmp = pi2c_reg->I2C_SS_SCL_LCNT;
    } else if (((ic_con_tmp & I2C_MASK_SPD)>>I2C_SHIFT_SPD) == I2CFastSpeed) {
        ic_value_tmp = pi2c_reg->I2C_FS_SCL_LCNT;
    } else {
        ic_value_tmp = pi2c_reg->I2C_HS_SCL_LCNT;
    }

    if (pi2c_init_data->master) {
        if (pi2c_init_data->sda_hold > (ic_value_tmp-2)) {
            ic_value_tmp = (ic_value_tmp-2);
            if (ic_value_tmp < I2C_MST_SDA_HOLD_MIN) {
                ic_value_tmp = I2C_MST_SDA_HOLD_MIN;
            }
            pi2c_reg->I2C_SDA_HOLD = ic_value_tmp;
        } else {
            pi2c_reg->I2C_SDA_HOLD = pi2c_init_data->sda_hold;
        }
    } else {
        if (pi2c_init_data->sda_hold > (ic_value_tmp-2)) {
            ic_value_tmp = (ic_value_tmp-2);
            if (ic_value_tmp < I2C_SLV_SDA_HOLD_MIN) {
                ic_value_tmp = I2C_SLV_SDA_HOLD_MIN;
            }
            pi2c_reg->I2C_SDA_HOLD = ic_value_tmp;
        } else {
            pi2c_reg->I2C_SDA_HOLD = pi2c_init_data->sda_hold;
        }

        /* to set SDA setup time, only for slave-transmitter */
        pi2c_reg->I2C_SDA_SETUP = (ic_value_tmp>>1);
    }

    isp_info("sda_setup: %x\n\r", pi2c_reg->I2C_SDA_SETUP);
    isp_info("sda_hold: %x\n\r", pi2c_reg->I2C_SDA_HOLD);
    //DBG_8195BL("sda_setup: %x\n\r", pi2c_reg->sda_setup);
    //DBG_8195BL("sda_hold: %x\n\r", pi2c_reg->sda_hold);
    /* To set default digital filter */
    ic_filter_tmp = 0;
    HAL_SET_BIT(ic_filter_tmp, (pi2c_init_data->dig_fltr_en<<I2C_SHIFT_DIG_FLTR_EN)
                                    |(pi2c_init_data->dig_fltr_lvl<<I2C_SHIFT_DIG_FLTR_DEG));
    pi2c_reg->I2C_FLTR  = ic_filter_tmp;

    /* To set TX_Empty Level */
    pi2c_reg->I2C_TX_TL = pi2c_init_data->ff_txtl;

    /* To set RX_Full Level */
    pi2c_reg->I2C_RX_TL = pi2c_init_data->ff_rxtl;

    isp_info("pi2c_reg->tx_tl[%x]: %x\n\r", &pi2c_reg->I2C_TX_TL, pi2c_reg->I2C_TX_TL);
    isp_info("pi2c_reg->rx_tl[%x]: %x\n\r", &pi2c_reg->I2C_RX_TL, pi2c_reg->I2C_RX_TL);
    /* To set DMA default TX/RX FIFO level */
    pi2c_reg->I2C_DMA_TDLR = 0x09;
    pi2c_reg->I2C_DMA_RDLR = 0x03;
    isp_info("Init i2c dev, dma_tdlr%d[%2x]: %x\n\r", pi2c_init_data->index, &pi2c_reg->I2C_DMA_TDLR, pi2c_reg->I2C_DMA_TDLR);
    isp_info("Init i2c dev, dma_rdlr%d[%2x]: %x\n\r", pi2c_init_data->index, &pi2c_reg->I2C_DMA_RDLR, pi2c_reg->I2C_DMA_RDLR);

    /*I2C Clear all interrupts first*/
    READ_CLEAR_I2C_REG(pi2c_reg, I2C_CLR_INTR);

    /* Enable the IC first and return the enable status */
    return hal_rtl_i2c_en_ctrl_simple(phal_i2c_adapter, I2CEnable);
}

/** \brief Description of hal_rtl_i2c_pure_deinit_simple
 *
 *    hal_rtl_i2c_pure_deinit_simple is used to deinit I2C module.
 *    It's directly to disable I2C module.
 *
 *   \param hal_i2c_adapter_t *phal_i2c_adapter:     Pointer to I2C control adapter.
 *   \return uint8_t
 */
uint8_t hal_rtl_i2c_pure_deinit_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    return hal_rtl_i2c_en_ctrl_simple(phal_i2c_adapter, I2CDisable);
}

/** \brief Description of hal_rtl_i2c_wr_simple
 *
 *    hal_rtl_i2c_wr_simple is used to send I2C data. In master mode, this function could send write command, too.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:     Pointer to I2C control adapter.
 *   \param[in] const uint8_t *dat_buf:     Data buffer address for I2C write.
 *   \param[in] uint32_t dat_len:           Data length for I2C write.
 *   \param[in] uint8_t ctrl:           To control what I2C would do when data is all sent. (Only for Master Mode)\n\r
 *                                      In slave mode, this part should be always 0.\n\r
 *                                      0: Do nothing. There will not be a STOP condition when all data is sent.\n\r
 *                                      And there will not be any START/RESTART condition in the next transmission ,either.\n\r
 *                                      1: Send STOP after the last data.\n\r
 *                                      2: There will NOT be a STOP condition after the last data sent. But\n\r
 *                                      the next transmision would have a START/RESTART condition sent first.\n\r
 *                                      So setting 2 to this field could influence the following transmission.\n\r
 *   \return hal_status_t:      When the given Ctrl is NOT fit with hardware setting, a value of HAL_STS_ERR_HW\n\r
 *                              will be returned. Otherwise, a value of HAL_STS_OK will be returned.
 */
hal_status_t hal_rtl_i2c_wr_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter, const uint8_t *dat_buf, uint32_t dat_len, uint8_t ctrl)
{
    I2C_TypeDef *pi2c_reg = phal_i2c_adapter->init_dat.reg_base;
    uint32_t dat_cnt  = 0;
    uint32_t ic_dat_cmd;

    /* Check RESTART configuration is enabled or not */
    //if ((ctrl == 2) && (BIT_GET_IC_RESTART_EN(pi2c_reg->con) == 0)) {
    if ((ctrl == 2) && ((pi2c_reg->I2C_CON & I2C_BIT_RSTRT_EN) == 0)) {
        return HAL_ERR_HW;
    }

    for (dat_cnt = 0; dat_cnt < dat_len; dat_cnt++) {
        ic_dat_cmd = 0;
        if ((dat_cnt == (dat_len -1)) &&  (ctrl != 0)){
            ic_dat_cmd |= (0x01 << (I2C_SHIFT_STP+ctrl-1));
        }
        HAL_SET_BIT(ic_dat_cmd, (((uint8_t)(*(dat_buf+dat_cnt)))<<I2C_SHIFT_DAT));
        HAL_CLEAR_BIT(ic_dat_cmd, I2C_BIT_CMD); /* i2c write */
        isp_info("dat_cnt = %x, dc: %x, ctrl: %x\n\r", dat_cnt, ic_dat_cmd, ctrl);
        pi2c_reg->I2C_DAT_CMD = ic_dat_cmd;
    }

    return HAL_OK;
}

/** \brief Description of hal_rtl_i2c_mst_send_rdcmd_simple
 *
 *    hal_rtl_i2c_mst_send_rdcmd_simple is used to send I2C master read command.
 *    It should only be used for master mode.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:     Pointer to I2C control adapter.
 *   \param[in] uint32_t cmd_len:           Read commnad length for I2C read.
 *   \param[in] uint8_t ctrl:               To control what I2C would do when data is all sent. (Only for Master Mode)\n\r
 *                                      0: Do nothing. There will not be a STOP condition when all data is sent.\n\r
 *                                      And there will not be any START/RESTART condition in the next transmission ,either.\n\r
 *                                      1: Send STOP after the last data.\n\r
 *                                      2: There will NOT be a STOP condition after the last data sent. But\n\r
 *                                      the next transmision would have a START/RESTART condition sent first.\n\r
 *                                      So setting 2 to this field could influence the following transmission.
 *
 *  \return void
 */
void hal_rtl_i2c_mst_send_rdcmd_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter, uint32_t cmd_len, uint8_t ctrl)
{
    uint32_t cmd_cnt = 0;
    uint32_t ic_dat_cmd;

    for (cmd_cnt = 0; cmd_cnt < cmd_len; cmd_cnt++) {
        ic_dat_cmd = 0;

        if ((cmd_cnt == (cmd_len -1)) &&  (ctrl != 0)){
            ic_dat_cmd |= (0x01 << (I2C_SHIFT_STP+ctrl-1));
        }

