Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/drv/i2c/rtl8735b_i2c_simple.c
        HAL_SET_BIT(ic_dat_cmd, I2C_BIT_CMD);   /* i2c read */
        phal_i2c_adapter->init_dat.reg_base->I2C_DAT_CMD = ic_dat_cmd;
    }
}


/** \brief Description of hal_rtl_i2c_dma_ctrl_simple
 *
 *    hal_rtl_i2c_dma_ctrl_simple is used to enable/disable I2C DMA function.\n\r
 *    Enable is used to control that this function performs enable or disable operaiton.\n\r
 *    And it would set/clear related register according to the given DMAEnMsk.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:     Pointer to I2C control adapter.
 *   \param[in] uint8_t enable:             To enable/disable I2C DMA function.\n\r
 *                                      0: Disable.\n\r
 *                                      1: Enable.
 *   \return uint32_t:         I2C DMA enable status.
 */
uint32_t hal_rtl_i2c_dma_ctrl_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter, uint8_t enable)
{
    I2C_TypeDef *pi2c_reg = phal_i2c_adapter->init_dat.reg_base;
    uint32_t ic_dma_cmd_tmp;

    if (enable == I2CForceDisable) {
        /* To disable I2C DMA */
        ic_dma_cmd_tmp = pi2c_reg->I2C_DMA_CMD;
        ic_dma_cmd_tmp &= (uint32_t)(~(I2C_BIT_DMA_EN));

        pi2c_reg->I2C_DMA_CMD = ic_dma_cmd_tmp;
    } else {
        while (pi2c_reg->I2C_DMA_CMD & I2C_BIT_DMA_EN){
        }

        while (pi2c_reg->I2C_RAW_INTR_STAT & I2C_BIT_RAW_DMA_I2C_DONE){
        }

        /* To disable I2C DMA */
        ic_dma_cmd_tmp = pi2c_reg->I2C_DMA_CMD;
        ic_dma_cmd_tmp &= (uint32_t)(~(I2C_BIT_DMA_EN));
        if (enable) {
            ic_dma_cmd_tmp |= (I2C_BIT_DMA_EN);
        }

        pi2c_reg->I2C_DMA_CMD = ic_dma_cmd_tmp;
    }

    isp_info("dam_cmd: %x\n\r", pi2c_reg->I2C_DMA_CMD);
    return (uint32_t)(pi2c_reg->I2C_DMA_CMD);
}

/** \brief Description of hal_rtl_i2c_mst_restr_ctrl_simple
 *
 *    hal_rtl_i2c_mst_restr_ctrl_simple is used to enable/disable RESTART feature.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:     Pointer to I2C control adapter.
 *   \param[in] uint8_t restr_en:               To enable/disable I2C RESTART fearture. Software should enable\n\r
 *                                              this feature before it sets RESTART command in REG_IC_DATA_CMD\n\r
 *                                              register.
 *   \return hal_status_t
 */
hal_status_t hal_rtl_i2c_mst_restr_ctrl_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter, uint8_t restr_en)
{
    I2C_TypeDef *pi2c_reg = phal_i2c_adapter->init_dat.reg_base;
    uint32_t ic_en_sts_bak;
    uint32_t    ic_con_tmp;

    /* Check if I2C is in master mode. */
    if (hal_rtl_i2c_chk_mod_simple(phal_i2c_adapter) != 1) {
        return HAL_ERR_PARA;
    }

    /* Disable i2c first */
    ic_en_sts_bak = pi2c_reg->I2C_EN_STS;
    if (ic_en_sts_bak & I2C_BIT_EN_STS) {
        if (hal_rtl_i2c_en_ctrl_simple(phal_i2c_adapter, I2CDisable)) {
            return HAL_ERR_HW;
        }
    }

    if (((phal_i2c_adapter->init_dat.addr_mod == I2CAddress10bit) || (phal_i2c_adapter->init_dat.spd_mod == I2CHighSpeed))
        && (restr_en == I2CDisable)) {
        isp_error("RESTART enable could not be disabled in 10bit or high speed mode\n\r");
        return HAL_ERR_PARA;
    }

    ic_con_tmp = pi2c_reg->I2C_CON;
    HAL_CLEAR_BIT(ic_con_tmp, I2C_BIT_RSTRT_EN);
    HAL_SET_BIT(ic_con_tmp, restr_en << I2C_SHIFT_RSTRT_EN);
    pi2c_reg->I2C_CON = ic_con_tmp;

    if (ic_en_sts_bak & I2C_BIT_EN_STS) {
        hal_rtl_i2c_en_ctrl_simple(phal_i2c_adapter, I2CEnable);
    }

    return HAL_OK;
}


/** \brief Description of hal_rtl_i2c_pin_init_simple
 *
 *    hal_rtl_i2c_pin_init_simple is used to initialize i2c clock and pin.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_rtl_i2c_pin_init_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{

    return HAL_OK;

}

/** \brief Description of hal_rtl_i2c_pin_deinit_simple
 *
 *    hal_rtl_i2c_pin_deinit_simple is used to deinitialize i2c clock and pin.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_rtl_i2c_pin_deinit_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    return HAL_OK;
}

/** \brief Description of hal_rtl_i2c_init_simple
 *
 *    hal_rtl_i2c_init_simple is used to initialize i2c including platform related features.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_i2c_init_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    hal_rtl_i2c_pure_init_simple(phal_i2c_adapter);

    if (phal_i2c_adapter->init_dat.reg_base->I2C_EN_STS & I2C_BIT_EN_STS) {
        phal_i2c_adapter->status   = I2CStatusInitialized;
        phal_i2c_adapter->init_dat.enable  = I2CEnable;
        phal_i2c_adapter->status   = I2CStatusIdle;
        return HAL_OK;
    } else {
        phal_i2c_adapter->status   = I2CStatusUninitial;
        phal_i2c_adapter->init_dat.enable  = I2CDisable;
        return HAL_ERR_HW;
    }

}

/** \brief Description of hal_rtl_i2c_deinit_simple
 *
 *    hal_rtl_i2c_deinit_simple is used to deinitialize i2c including platform related features.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_i2c_deinit_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    phal_i2c_adapter->init_dat.enable  = hal_rtl_i2c_pure_deinit_simple(phal_i2c_adapter);

    if (phal_i2c_adapter->init_dat.reg_base->I2C_EN_STS & I2C_BIT_EN_STS) {
        return HAL_ERR_HW;
    } else {
        phal_i2c_adapter->status     = I2CStatusUninitial;
        return HAL_OK;
    }
}

/** \brief Description of hal_rtl_i2c_load_default_simple
 *
 *    hal_rtl_i2c_load_default_simple is used to load default setting for i2c module.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \param[in] uint8_t index:   i2c device index.
 *   \return hal_status_t
 */
hal_status_t hal_rtl_i2c_load_default_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter, uint8_t index)
{
    i2c_init_dat_t  *pi2c_init_dat      = (i2c_init_dat_t  *)&(phal_i2c_adapter->init_dat);
    i2c_platform_data_t *pi2c_plft_dat  = (i2c_platform_data_t *)&(phal_i2c_adapter->pltf_dat);
    i2c_user_callback_t *pi2c_usr_cb    = (i2c_user_callback_t *)&(phal_i2c_adapter->usr_cb);

    /* Check the input I2C index first */
    if (hal_rtl_i2c_idx_chk(index)) {
        return HAL_ERR_UNKNOWN;
    }

    phal_i2c_adapter->init_dat.index = index;

