Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/drv/i2c/rtl8735b_i2c_simple.c
    /* I2C Initial Default Configuration */
    pi2c_init_dat->enable       = I2CDisable;
    pi2c_init_dat->master       = I2CMasterMode;
    pi2c_init_dat->addr_mod     = I2CAddress7bit;
    pi2c_init_dat->spd_mod      = I2CStandardSpeed;
    pi2c_init_dat->sda_setup    = 2;
    pi2c_init_dat->ff_rxtl      = 0x00;
    pi2c_init_dat->ff_txtl      = 0x00;
    pi2c_init_dat->clock        = 100;              // 100 kHz
    pi2c_init_dat->ack_addr0    = 0x11;
    pi2c_init_dat->ack_addr1    = 0x11;
    pi2c_init_dat->sda_hold     = 4;
    pi2c_init_dat->bus_ld       = 100;
    pi2c_init_dat->dig_fltr_en  = I2CEnable;
    pi2c_init_dat->dig_fltr_lvl = 2;

    pi2c_plft_dat->tr_time_out  = 0xFFFFFFFF;

    /* I2C Interrupt Handle Configuration */
    switch (phal_i2c_adapter->init_dat.index) {
        case 0:
            pi2c_init_dat->reg_base     = (void *)I2C0_BASE;
            break;
        case 1:
            pi2c_init_dat->reg_base     = (void *)I2C1_BASE;
            break;
        case 2:
            pi2c_init_dat->reg_base     = (void *)I2C2_BASE;
            break;
        case 3:
            pi2c_init_dat->reg_base     = (void *)I2C3_BASE;
            break;

        default:
            return HAL_ERR_UNKNOWN;
    }

    phal_i2c_adapter->status   = I2CStatusUninitial;
    phal_i2c_adapter->op_mode  = I2CModePoll;
    //phal_i2c_adapter->mst_spe_func |= I2CAddressRetry;
    phal_i2c_adapter->err_type = I2CErrorNone;
    phal_i2c_adapter->rd_cmd_no= 0;

    /* Clear USER Callback Function Pointer */
    memset(pi2c_usr_cb, 0x00, sizeof(i2c_user_callback_t));

    /* Clear TRX information */
    memset((hal_i2c_adapter_t *)&(phal_i2c_adapter->tx_dat), 0x00, sizeof(i2c_tx_info_t));
    memset((hal_i2c_adapter_t *)&(phal_i2c_adapter->rx_dat), 0x00, sizeof(i2c_rx_info_t));

    return HAL_OK;
}

/** \brief Description of hal_rtl_i2c_set_tar_simple
 *
 *    hal_rtl_i2c_set_tar_simple is to set target slave address in master mode.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \param[in] uint8_t mst_rw:   This target address is for read or write usage.
 *   \return hal_status_t
 */
hal_status_t hal_rtl_i2c_set_tar_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter, uint8_t mst_rw)
{
    uint32_t start_time = 0;
    I2C_TypeDef *pi2c_reg = (I2C_TypeDef *)(phal_i2c_adapter->init_dat.reg_base);
    uint32_t ic_tar_tmp;

    /* check if it's necessary to update TAR */
    ic_tar_tmp  = pi2c_reg->I2C_TAR;
    if (mst_rw == 0) {
        if (((ic_tar_tmp & I2C_MASK_TAR) >> I2C_SHIFT_TAR) != phal_i2c_adapter->tx_dat.addr) {
            HAL_CLEAR_BIT(ic_tar_tmp, I2C_MASK_TAR);
            HAL_SET_BIT(ic_tar_tmp, phal_i2c_adapter->tx_dat.addr << I2C_SHIFT_TAR);
        } else {
            return HAL_OK;
        }
    } else {
        if ((ic_tar_tmp & I2C_MASK_TAR) >> I2C_SHIFT_TAR != phal_i2c_adapter->rx_dat.addr) {
            HAL_CLEAR_BIT(ic_tar_tmp, I2C_MASK_TAR);
            HAL_SET_BIT(ic_tar_tmp, phal_i2c_adapter->rx_dat.addr << I2C_SHIFT_TAR);
        } else {
            return HAL_OK;
        }
    }

    /* Check TX FIFO status, wait for all tx is done. */
    start_time = hal_read_curtime_us();
    //while (!BIT_GET_IC_TFE(pi2c_reg->status)) {
    while((pi2c_reg->I2C_STS & I2C_BIT_STS_TFE) == 0){
        if (hal_rtl_i2c_timeout_chk_simple(phal_i2c_adapter, start_time) == 1) {
            phal_i2c_adapter->status   = I2CStatusTimeOut;
            phal_i2c_adapter->err_type = I2CErrorTarTimeOut;
            if (phal_i2c_adapter->usr_cb.err.cb != NULL) {
                phal_i2c_adapter->usr_cb.err.cb((void *)phal_i2c_adapter->usr_cb.err.dat);
            }

            return HAL_TIMEOUT;
        }
    }

    /* Check Master activity status, wait until it's ready */
    start_time  = hal_read_curtime_us();
    //while (BIT_GET_MST_ACTIVITY(pi2c_reg->status)) {
    while(pi2c_reg->I2C_STS & I2C_BIT_STS_MST_ACT){
        if (hal_rtl_i2c_timeout_chk_simple(phal_i2c_adapter, start_time) == 1) {
            phal_i2c_adapter->status   = I2CStatusTimeOut;
            phal_i2c_adapter->err_type = I2CErrorTarTimeOut;
            if (phal_i2c_adapter->usr_cb.err.cb != NULL) {
                phal_i2c_adapter->usr_cb.err.cb((void *)phal_i2c_adapter->usr_cb.err.dat);
            }

            return HAL_TIMEOUT;
        }
    }

    pi2c_reg->I2C_TAR = ic_tar_tmp;
    return HAL_OK;
}

/** \brief Description of hal_rtl_i2c_send_poll_simple
 *
 *    hal_rtl_i2c_send_poll_simple is to send i2c data by polling (blocking) mode.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_rtl_i2c_send_poll_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    i2c_tx_info_t   *pi2c_tx_info = (i2c_tx_info_t *)&(phal_i2c_adapter->tx_dat);
    I2C_TypeDef *pi2c_reg = (I2C_TypeDef *)phal_i2c_adapter->init_dat.reg_base;
    uint32_t start_time  = 0;
    uint32_t ic_raw_state_tmp;
    uint8_t  wr_ctrl = 0;

    start_time = hal_read_curtime_us();

    for (;;) {
        if (pi2c_tx_info->len == 0) {
            break;
        }

        phal_i2c_adapter->status = I2CStatusTxing;
        ic_raw_state_tmp = pi2c_reg->I2C_RAW_INTR_STAT;
        //if (ic_raw_state_tmp.d32 & (BIT_RAW_TX_OVER | BIT_RAW_TX_ABRT)) {
        if ((ic_raw_state_tmp & I2C_BIT_RAW_TX_OVER) || (ic_raw_state_tmp & I2C_BIT_RAW_TX_ABRT)) {
            phal_i2c_adapter->status = I2CStatusError;
            if (ic_raw_state_tmp & I2C_BIT_RAW_TX_OVER) {
                phal_i2c_adapter->err_type = I2CErrorTxOver;
            } else {
                phal_i2c_adapter->err_type = I2CErrorTxAbort;
            }

            if (phal_i2c_adapter->usr_cb.err.cb != NULL) {
                phal_i2c_adapter->usr_cb.err.cb((void *)phal_i2c_adapter->usr_cb.err.dat);
            }

            return HAL_ERR_HW;
        //} else if (BIT_GET_IC_TFNF(pi2c_reg->status)) {
        } else if (pi2c_reg->I2C_STS & I2C_BIT_STS_TFNF) {
            /* Wrtie data into I2C TX FIFO */
            wr_ctrl = 0;
            if (pi2c_tx_info->len == 1) {
                if (phal_i2c_adapter->mst_spe_func & I2CMasterRestart) {
                    wr_ctrl = 2;    /* Set RESTART for the next byte */
                } else {
                    if (pi2c_tx_info->mst_stop == 1) {
                        wr_ctrl = 1;    /* Set STOP for the last byte */
                    }
                }
            }
            hal_rtl_i2c_wr_simple(phal_i2c_adapter, pi2c_tx_info->buf, 1, wr_ctrl);
            pi2c_tx_info->buf++;
			if (pi2c_tx_info->len > 10) {
				printf("i2c err len: %x\n\r", pi2c_tx_info->len);
				phal_i2c_adapter->status   = I2CStatusError;
                phal_i2c_adapter->err_type = I2CErrorTxAbort;
                if (phal_i2c_adapter->usr_cb.err.cb != NULL) {
                    phal_i2c_adapter->usr_cb.err.cb((void *)phal_i2c_adapter->usr_cb.err.dat);
                }
				return HAL_ERR_PARA;
			}
				
            pi2c_tx_info->len--;
            start_time = hal_read_curtime_us();
            
        } else {
            if (hal_rtl_i2c_timeout_chk_simple(phal_i2c_adapter, start_time) == 1) {
                phal_i2c_adapter->status   = I2CStatusTimeOut;
                phal_i2c_adapter->err_type = I2CErrorTxCmdTimeOut;
                if (phal_i2c_adapter->usr_cb.err.cb != NULL) {
                    phal_i2c_adapter->usr_cb.err.cb((void *)phal_i2c_adapter->usr_cb.err.dat);
                }

