Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/drv/i2c/rtl8735b_i2c_simple.c
                return HAL_TIMEOUT;
            }
        }
    }

    start_time = hal_read_curtime_us();
    while(!(pi2c_reg->I2C_STS & I2C_BIT_STS_TFE)) {
        if (hal_rtl_i2c_timeout_chk_simple(phal_i2c_adapter, start_time) == 1) {
            phal_i2c_adapter->status   = I2CStatusTimeOut;
            phal_i2c_adapter->err_type = I2CErrorTxCmdTimeOut;
            if (phal_i2c_adapter->usr_cb.err.cb != NULL) {
                phal_i2c_adapter->usr_cb.err.cb((void *)phal_i2c_adapter->usr_cb.err.dat);
            }

            return HAL_TIMEOUT;
        }
		ic_raw_state_tmp = pi2c_reg->I2C_RAW_INTR_STAT;
        if ((ic_raw_state_tmp & I2C_BIT_RAW_TX_OVER) || (ic_raw_state_tmp & I2C_BIT_RAW_TX_ABRT)) {
            phal_i2c_adapter->status = I2CStatusError;
            if (ic_raw_state_tmp & I2C_BIT_RAW_TX_OVER) {
                phal_i2c_adapter->err_type = I2CErrorTxOver;
            } else {
                phal_i2c_adapter->err_type = I2CErrorTxAbort;
            }

            if (phal_i2c_adapter->usr_cb.err.cb != NULL) {
                phal_i2c_adapter->usr_cb.err.cb((void *)phal_i2c_adapter->usr_cb.err.dat);
            }

            return HAL_ERR_HW;
        }
    }
    
    phal_i2c_adapter->status = I2CStatusIdle;
    if (phal_i2c_adapter->usr_cb.txc.cb != NULL) {
        phal_i2c_adapter->usr_cb.txc.cb((void *)phal_i2c_adapter->usr_cb.txc.dat);
    }

    return HAL_OK;
}

/** \brief Description of hal_rtl_i2c_recv_poll_simple
 *
 *    hal_rtl_i2c_recv_poll_simple is to receive I2C data by polling (blocking) mode.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_rtl_i2c_recv_poll_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    i2c_rx_info_t   *pi2c_rx_info = (i2c_rx_info_t *)&(phal_i2c_adapter->rx_dat);
    I2C_TypeDef *pi2c_reg = (I2C_TypeDef *)phal_i2c_adapter->init_dat.reg_base;
    uint32_t ic_sts_tmp;
    uint32_t ic_raw_state_tmp;
    uint32_t start_time  = 0;
    uint8_t  wr_ctrl     = 0;

    if (!(phal_i2c_adapter->mst_spe_func & I2CAddressRetry)) {
        phal_i2c_adapter->rd_cmd_no = pi2c_rx_info->len;
        READ_CLEAR_I2C_REG(pi2c_reg, I2C_CLR_TX_ABRT);
        READ_CLEAR_I2C_REG(pi2c_reg, I2C_CLR_ACT);
        READ_CLEAR_I2C_REG(pi2c_reg, I2C_CLR_INTR);
    }

    start_time = hal_read_curtime_us();
    for (;;) {
        if (pi2c_rx_info->len == 0) {
            break;
        }

        phal_i2c_adapter->status = I2CStatusRxing;
        ic_raw_state_tmp = pi2c_reg->I2C_RAW_INTR_STAT;
        if (((ic_raw_state_tmp) & (I2C_BIT_RAW_RX_UNDER | I2C_BIT_RAW_RX_OVER | I2C_BIT_RAW_TX_OVER | I2C_BIT_RAW_TX_ABRT)) != 0) {
            phal_i2c_adapter->status = I2CStatusError;
            if ((ic_raw_state_tmp & I2C_BIT_RAW_RX_UNDER) != 0) {
                phal_i2c_adapter->err_type= I2CErrorRxUnder;
            } else if ((ic_raw_state_tmp & I2C_BIT_RAW_RX_OVER) != 0) {
                phal_i2c_adapter->err_type= I2CErrorRxOver;
            } else if ((ic_raw_state_tmp & I2C_BIT_RAW_TX_OVER) != 0) {
                phal_i2c_adapter->err_type= I2CErrorTxOver;
            } else if ((ic_raw_state_tmp & I2C_BIT_RAW_TX_ABRT) != 0) {
                phal_i2c_adapter->err_type= I2CErrorTxAbort;
            } else {
                phal_i2c_adapter->err_type= ic_raw_state_tmp;
            }

            if (phal_i2c_adapter->usr_cb.err.cb != NULL) {
                phal_i2c_adapter->usr_cb.err.cb((void *)phal_i2c_adapter->usr_cb.err.dat);
            }

            return HAL_ERR_HW;
//        } else if (BIT_GET_IC_TFNF(pi2c_reg->status)) {
        } else if (pi2c_reg->I2C_STS & I2C_BIT_STS_TFE) {
            if (phal_i2c_adapter->rd_cmd_no > 0) {
                /* Wrtie cmd into I2C TX FIFO */
                wr_ctrl = 0;
                if (phal_i2c_adapter->rd_cmd_no == 1) {
                    if (phal_i2c_adapter->mst_spe_func & I2CMasterRestart) {
                        wr_ctrl = 2;    /* Set RESTART for the next byte */
                    } else {
                        if (pi2c_rx_info->mst_stop == 1) {
                            wr_ctrl = 1;    /* Set STOP for the last byte */
                        }
                    }
                }
                isp_info("rx wr_ctrl:%x: %x\n\r", wr_ctrl, (pi2c_reg->I2C_STS & I2C_BIT_STS_TFE));
                hal_rtl_i2c_mst_send_rdcmd_simple(phal_i2c_adapter, 1, wr_ctrl);
                phal_i2c_adapter->rd_cmd_no--;
                start_time = hal_read_curtime_us();
            }
        } else {
            if (hal_rtl_i2c_timeout_chk_simple(phal_i2c_adapter, start_time) == 1) {
                phal_i2c_adapter->status = I2CStatusTimeOut;
                phal_i2c_adapter->err_type= I2CErrorRxCmdTimeOut;
                if (phal_i2c_adapter->usr_cb.err.cb != NULL) {
                    phal_i2c_adapter->usr_cb.err.cb((void *)phal_i2c_adapter->usr_cb.err.dat);
                }

                return HAL_TIMEOUT;
            }
        }

        ic_sts_tmp = pi2c_reg->I2C_STS;
        if (((ic_sts_tmp & I2C_BIT_STS_RFNE) != 0) || ((ic_sts_tmp & I2C_BIT_STS_RFF) != 0)) {
            *(pi2c_rx_info->buf) = pi2c_reg->I2C_DAT_CMD;
            pi2c_rx_info->buf++;
            pi2c_rx_info->len--;
        }
    }

    if (phal_i2c_adapter->usr_cb.rxc.cb != NULL) {
        phal_i2c_adapter->usr_cb.rxc.cb((void *)phal_i2c_adapter->usr_cb.rxc.dat);
    }

    phal_i2c_adapter->status = I2CStatusIdle;
    return HAL_OK;
}



/** \brief Description of hal_i2c_send
 *
 *    hal_i2c_send is an upper layer I2C send transfer API. It executes the related send(TX) API according \n\r
 *    to the phal_i2c_adapter->op_mode.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_i2c_send_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    i2c_tx_info_t   *pi2c_tx_info = (i2c_tx_info_t *)&(phal_i2c_adapter->tx_dat);
    hal_status_t retv = HAL_OK;

    if (phal_i2c_adapter->op_mode <= I2CModeDMA) {
        hal_rtl_i2c_set_tar_simple(phal_i2c_adapter, I2CWrite);

        if (pi2c_tx_info->len == 0) {
            phal_i2c_adapter->status = I2CStatusIdle;
            if (phal_i2c_adapter->usr_cb.txc.cb != NULL) {
                phal_i2c_adapter->usr_cb.txc.cb((void *)phal_i2c_adapter->usr_cb.txc.dat);
            }
            return (hal_status_t)retv;
        }

        retv = hal_rtl_i2c_send_poll_simple(phal_i2c_adapter);

    }  else {
        retv = HAL_ERR_UNKNOWN;
    }

    return (hal_status_t)retv;
}

/** \brief Description of hal_i2c_receive
 *
 *    hal_i2c_receive is an upper layer I2C receive transfer API. It executes the related receive(RX) API according
 *    to the phal_i2c_adapter->op_mode.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_i2c_receive_simple (volatile hal_i2c_adapter_t *phal_i2c_adapter)
{
    i2c_rx_info_t   *pi2c_rx_info = (i2c_rx_info_t *)&(phal_i2c_adapter->rx_dat);
    hal_status_t retv = HAL_OK;

    if (phal_i2c_adapter->op_mode <= I2CModeDMA) {
        hal_rtl_i2c_set_tar_simple(phal_i2c_adapter, 1);

        if (pi2c_rx_info->len == 0) {
            phal_i2c_adapter->status = I2CStatusIdle;
            if (phal_i2c_adapter->usr_cb.rxc.cb != NULL) {
                phal_i2c_adapter->usr_cb.rxc.cb((void *)phal_i2c_adapter->usr_cb.rxc.dat);
            }
            return (hal_status_t)retv;
        }

        retv = hal_rtl_i2c_recv_poll_simple(phal_i2c_adapter);

    } else {
        retv = HAL_ERR_UNKNOWN;
    }

    return (hal_status_t)retv;
}

#endif

/** @} */ /* End of group hs_hal_i2c_rom_func */
/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

/** @} */ /* End of group hs_hal_i2c */

